{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_221": {"name": "keras_tensor_221:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "212"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "212"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "212"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "212"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "212"}, {"size": "44"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "44"}, {"size": "216"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "216"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "216"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "216"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "216"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "keras_tensor_221", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "13"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["keras_tensor_221", "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_5_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_6_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_6_1/Relu", "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1_1/dense_7_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_7_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "shape": [13, 212], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp", "shape": [212], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/mul", "shape": [212], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_3_1/batchnorm/sub", "shape": [212], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "shape": [212, 44], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp", "shape": [44], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/mul", "shape": [44], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_4_1/batchnorm/sub", "shape": [44], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/Cast/ReadVariableOp", "shape": [44, 216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_6_1/BiasAdd/ReadVariableOp", "shape": [216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/mul", "shape": [216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/batch_normalization_5_1/batchnorm/sub", "shape": [216], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Cast/ReadVariableOp", "shape": [216, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_7_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}